// Модуль для констант и исходных значений массивов



//Массив имён
const NAMES = [
  'Иван',
  'Алексей',
  'Мария',
  'Анастасия',
  'Виктор',
  'Юлия',
  'Александр',
  'Светлана',
];

// Массив сообщений
const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];


//Массив описаний
const DESCRIPTIONS = [
  'Закат у моря',
  'Весенне утро',
  'Рыбалка у реки',
  'Вечерние пробки',
  'Первый снег',
  'Ремонт дороги',
  'Стройка нового дома',
  'Солнечное затмение',
  'Проливные дожди',
  'Облачное небо',
  'Ночной шторм',
  'Зимний парк',
  'Летний пикник',
  'Путешествие на велосипеде',
  'Книжная полка',
  'Старое здание',
  'Новый памятник',
  'Отдых на пляже',
  'Поход в горы',
  'Креативное искусство',
  'Современная архитектура',
  'Кафе на углу дома',
  'Развод мостов',
  'Летящий самолёт',
  'Прогулка на катере',
  'Осенние ветра'
]

const PHOTO_COUNT = 25;
const MIN_COMMENTS = 0;
const MAX_COMMENTS = 30;
const MIN_LIKES = 15;
const MAX_LIKES = 200;
const MIN_AVATAR_ID = 1;
const MAX_AVATAR_ID = 6;

export {
  NAMES,
  MESSAGES,
  DESCRIPTIONS,
  PHOTO_COUNT,
  MIN_COMMENTS,
  MAX_COMMENTS,
  MIN_LIKES,
  MAX_LIKES,
  MIN_AVATAR_ID,
  MAX_AVATAR_ID
};
